{
  "Demenure": [
    "keep eye contact.",
    "Sit still. Posture - straight, relaxed. No crossed legs or arms.",
    "talk slowly and articulate. Don't rush it and don't mumble, basically",
    "smiling never hurts to bring more energy, seem more engaging and positive",
    "Thank everyone involved for taking the time to meet/talk"
  ],
  "template phrases": [
    "that is a very good question, let me think about that one for a moment.",
    "I haven't thought about that before, but if I were to give you an answer here and now...",
    "As I understand your question, I ...",
    "Something I learned about myself during my time at SALT is ...",
    "The reason \"X\" is important to me is because of \"Y\" and \"Z\"",
    "If you would ask me what I believe to be the top three skills as a web developer I would say ...",
    "I have found that I thrive in a work environment where ...",
    "I would like to tie in to what you said before about X, this resonates with my values/experience ..."
  ],
  "introducing yourself": {
    "goals with introduction": [
      "get personal and establish some connection, rapport",
      "comunicate your journey, and where you are professionaly",
      "comunicate interests and who you are as a person"
    ],
    "keypoints": {
      "Starting point: When was your initial contact with coding/technology?": [
        "what sparked your interest for coding and how did it manifest itself?"
      ],
      "Key events/turning points in your life that pushed you in this direction": [
        "Everything relating to technology counts: hobbies when you were younger, dabbling with code,, online bootcamps, internships, interrupted studies, working in a technical environment etc.",
        "Mention what code languages and tools you've touched upon before.",
        "Add notes about how one thing led to another."
      ],
      "wrap up": [
        "Why did you decide to apply to SALT?",
        "Share some reflections about your experience SALT.",
        "What are your thoughts for the future?"
      ]
    }
  }
}